---
title: LinkFailures
classe: Autodesk.Revit.DB.BuiltInFailures+LinkFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# LinkFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotModifyLinkedFile { get; }` | `LinkFailures.CannotModifyLinkedFile` | FailureDefinitionId |
| `FailureDefinitionId CannotOpenLinkedFileServerFound { get; }` | `LinkFailures.CannotOpenLinkedFileServerFound` | FailureDefinitionId |
| `FailureDefinitionId CannotOpenLinkedFileServerNotFound { get; }` | `LinkFailures.CannotOpenLinkedFileServerNotFound` | FailureDefinitionId |
| `FailureDefinitionId CannotPublishSharedCoordinatesToMirroredNonRevitLinks { get; }` | `LinkFailures.CannotPublishSharedCoordinatesToMirroredNonRevitLinks` | FailureDefinitionId |
| `FailureDefinitionId CannotReloadFile { get; }` | `LinkFailures.CannotReloadFile` | FailureDefinitionId |
| `FailureDefinitionId CannotUnlinkFile { get; }` | `LinkFailures.CannotUnlinkFile` | FailureDefinitionId |
| `FailureDefinitionId DataDictionaryDifferentInLink { get; }` | `LinkFailures.DataDictionaryDifferentInLink` | FailureDefinitionId |
| `FailureDefinitionId DeleteLinkSymbolPrompt { get; }` | `LinkFailures.DeleteLinkSymbolPrompt` | FailureDefinitionId |
| `FailureDefinitionId LinkedFileOpenInOtherDoc { get; }` | `LinkFailures.LinkedFileOpenInOtherDoc` | FailureDefinitionId |
| `FailureDefinitionId LinkInstanceNeedsReconcile { get; }` | `LinkFailures.LinkInstanceNeedsReconcile` | FailureDefinitionId |
| `FailureDefinitionId ModifiedLinkedFile { get; }` | `LinkFailures.ModifiedLinkedFile` | FailureDefinitionId |
| `FailureDefinitionId ModifyingLinkedFile { get; }` | `LinkFailures.ModifyingLinkedFile` | FailureDefinitionId |
| `FailureDefinitionId MultipleLinks { get; }` | `LinkFailures.MultipleLinks` | FailureDefinitionId |
| `FailureDefinitionId NoConstraintsToLinks1 { get; }` | `LinkFailures.NoConstraintsToLinks1` | FailureDefinitionId |
| `FailureDefinitionId SourceFileDrivenByOtherTarget { get; }` | `LinkFailures.SourceFileDrivenByOtherTarget` | FailureDefinitionId |
| `FailureDefinitionId WatchedLinkMoved { get; }` | `LinkFailures.WatchedLinkMoved` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```